cmsis-svd/cmsis-svd/data/Spansion/MB9AFB4xN_svd.xml
    <!-- PERIPHERAL "BT5" -->
    <peripheral derivedFrom="BT0">
      <name>BT5</name>
      <baseAddress>0x40025240</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT6" -->
    <peripheral derivedFrom="BT0">
      <name>BT6</name>
      <baseAddress>0x40025280</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT7" -->
    <peripheral derivedFrom="BT0">
      <name>BT7</name>
      <baseAddress>0x400252C0</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "WC" -->
    <peripheral>
      <name>WC</name>
      <description>Watch Counter</description>
      <groupName>WC</groupName>
      <baseAddress>0x4003A000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WCRD" -->
        <register>
          <name>WCRD</name>
          <description>Watch Counter Read Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTR" -->
            <field>
              <name>CTR</name>
              <description>counter value</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCRL" -->
        <register>
          <name>WCRL</name>
          <description>Watch Counter Reload Register</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RLC" -->
            <field>
              <name>RLC</name>
              <description>reload value</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCCR" -->
        <register>
          <name>WCCR</name>
          <description>Watch Counter Control Register</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xCF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEN" -->
            <field>
              <name>WCEN</name>
              <description>Watch counter operation enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCOP" -->
            <field>
              <name>WCOP</name>
              <description>Watch counter operating state flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CS" -->
            <field>
              <name>CS</name>
              <description>Count clock select bits</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIE" -->
            <field>
              <name>WCIE</name>
              <description>Interrupt request enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIF" -->
            <field>
              <name>WCIF</name>
              <description>Interrupt request flag bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_SEL" -->
        <register>
          <name>CLK_SEL</name>
          <description>Clock Selection Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL_OUT" -->
            <field>
              <name>SEL_OUT</name>
              <description>Output clock selection bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL_IN" -->
            <field>
              <name>SEL_IN</name>
              <description>Input clock selection bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_EN" -->
        <register>
          <name>CLK_EN</name>
          <description>Division Clock Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK_EN_R" -->
            <field>
              <name>CLK_EN_R</name>
              <description>Division clock enable read bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLK_EN" -->
            <field>
              <name>CLK_EN</name>
              <description>Division clock enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
