cmsis-svd/cmsis-svd/data/Spansion/MB9AFB4xN_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXBUS" -->
    <peripheral>
      <name>EXBUS</name>
      <description>External Bus Interface</description>
      <groupName>EXBUS</groupName>
      <baseAddress>0x4003F000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MODE0" -->
        <register>
          <name>MODE0</name>
          <description>Mode Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3BFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOEXEUP" -->
            <field>
              <name>MOEXEUP</name>
              <description>select how to set the MOEX width</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXCSOF" -->
            <field>
              <name>MPXCSOF</name>
              <description>select a CS assertion from the start of accessing to the end of address output</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXDOFF" -->
            <field>
              <name>MPXDOFF</name>
              <description>select whether or not the address is output to the data lines in multiplex mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALEINV" -->
            <field>
              <name>ALEINV</name>
              <description>set up the polarity of the ALE signal</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXMODE" -->
            <field>
              <name>MPXMODE</name>
              <description>select operation bus mode</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SHRTDOUT" -->
            <field>
              <name>SHRTDOUT</name>
              <description>select to which idle cycle the write data output is extended</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>control the external RDY function</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAGE" -->
            <field>
              <name>PAGE</name>
              <description>NOR Flash memory page access mode </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NAND" -->
            <field>
              <name>NAND</name>
              <description>NAND Flash memory mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WEOFF" -->
            <field>
              <name>WEOFF</name>
              <description>disable the write enable signal (MWEX) operation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBMON" -->
            <field>
              <name>RBMON</name>
              <description>Read Byte Mask ON</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDTH" -->
            <field>
              <name>WDTH</name>
              <description>specify Data Width </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MODE1" -->
        <register derivedFrom="MODE0">
          <name>MODE1</name>
          <description>Mode Register 1</description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "MODE2" -->
        <register derivedFrom="MODE0">
          <name>MODE2</name>
          <description>Mode Register 2</description>
          <addressOffset>0x8</addressOffset>
        </register>
        <!-- REGISTER "MODE3" -->
        <register derivedFrom="MODE0">
          <name>MODE3</name>
          <description>Mode Register 3</description>
          <addressOffset>0xC</addressOffset>
        </register>
        <!-- REGISTER "MODE4" -->
        <register derivedFrom="MODE0">
          <name>MODE4</name>
          <description>Mode Register 4</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "MODE5" -->
        <register derivedFrom="MODE0">
          <name>MODE5</name>
          <description>Mode Register 5</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "MODE6" -->
        <register derivedFrom="MODE0">
          <name>MODE6</name>
          <description>Mode Register 6</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <!-- REGISTER "MODE7" -->
        <register derivedFrom="MODE0">
          <name>MODE7</name>
          <description>Mode Register 7</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "TIM0" -->
        <register>
          <name>TIM0</name>
          <description>Timing Register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x055FF00F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WIDLC" -->
            <field>
              <name>WIDLC</name>
              <description>Write Idle Cycle </description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WWEC" -->
            <field>
              <name>WWEC</name>
              <description>Write Enable Cycle</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WADC" -->
            <field>
              <name>WADC</name>
              <description>Write Address Setup cycle</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WACC" -->
            <field>
              <name>WACC</name>
              <description>Write Access Cycle</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIDLC" -->
            <field>
              <name>RIDLC</name>
              <description>Read Idle Cycle</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRADC" -->
            <field>
              <name>FRADC</name>
              <description>First Read Address Cycle </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RADC" -->
            <field>
              <name>RADC</name>
              <description>Read Address Setup cycle</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RACC" -->
            <field>
              <name>RACC</name>
              <description>Read Access Cycle</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIM1" -->
        <register derivedFrom="TIM0">
          <name>TIM1</name>
          <description>Timing Register 1</description>
          <addressOffset>0x24</addressOffset>
        </register>
